Zarh/ManaGunZ/MGZ/lib/fatfs/ffsample/lpc23xx/LPC2300.h
/*-----------------------------------------------------------*/
/* LPC2300 Register Definitions                              */
/* This file is a non-copyrighted public domain software.    */
/*-----------------------------------------------------------*/

#ifndef __LPC2300
#define __LPC2300
#include <stdint.h>

#define VICIRQStatus		(*(volatile uint32_t*)(0xFFFFF000))
#define VICFIQStatus		(*(volatile uint32_t*)(0xFFFFF004))
#define VICRawIntr			(*(volatile uint32_t*)(0xFFFFF008))
#define VICIntSelect		(*(volatile uint32_t*)(0xFFFFF00C))
#define VICIntEnable		(*(volatile uint32_t*)(0xFFFFF010))
#define VICIntEnClr			(*(volatile uint32_t*)(0xFFFFF014))
#define VICSoftInt			(*(volatile uint32_t*)(0xFFFFF018))
#define VICSoftIntClr		(*(volatile uint32_t*)(0xFFFFF01C))
#define VICProtection		(*(volatile uint32_t*)(0xFFFFF020))
#define VICSWPrioMask		(*(volatile uint32_t*)(0xFFFFF024))
#define VICVectAddr0		(*(volatile uint32_t*)(0xFFFFF100))
#define VICVectAddr1		(*(volatile uint32_t*)(0xFFFFF104))
#define VICVectAddr2		(*(volatile uint32_t*)(0xFFFFF108))
#define VICVectAddr3		(*(volatile uint32_t*)(0xFFFFF10C))
#define VICVectAddr4		(*(volatile uint32_t*)(0xFFFFF110))
#define VICVectAddr5		(*(volatile uint32_t*)(0xFFFFF114))
#define VICVectAddr6		(*(volatile uint32_t*)(0xFFFFF118))
#define VICVectAddr7		(*(volatile uint32_t*)(0xFFFFF11C))
#define VICVectAddr8		(*(volatile uint32_t*)(0xFFFFF120))
#define VICVectAddr9		(*(volatile uint32_t*)(0xFFFFF124))
#define VICVectAddr10		(*(volatile uint32_t*)(0xFFFFF128))
#define VICVectAddr11		(*(volatile uint32_t*)(0xFFFFF12C))
#define VICVectAddr12		(*(volatile uint32_t*)(0xFFFFF130))
#define VICVectAddr13		(*(volatile uint32_t*)(0xFFFFF134))
#define VICVectAddr14		(*(volatile uint32_t*)(0xFFFFF138))
#define VICVectAddr15		(*(volatile uint32_t*)(0xFFFFF13C))
#define VICVectAddr16		(*(volatile uint32_t*)(0xFFFFF140))
#define VICVectAddr17		(*(volatile uint32_t*)(0xFFFFF144))
#define VICVectAddr18		(*(volatile uint32_t*)(0xFFFFF148))
#define VICVectAddr19		(*(volatile uint32_t*)(0xFFFFF14C))
#define VICVectAddr20		(*(volatile uint32_t*)(0xFFFFF150))
#define VICVectAddr21		(*(volatile uint32_t*)(0xFFFFF154))
#define VICVectAddr22		(*(volatile uint32_t*)(0xFFFFF158))
#define VICVectAddr23		(*(volatile uint32_t*)(0xFFFFF15C))
#define VICVectAddr24		(*(volatile uint32_t*)(0xFFFFF160))
#define VICVectAddr25		(*(volatile uint32_t*)(0xFFFFF164))
#define VICVectAddr26		(*(volatile uint32_t*)(0xFFFFF168))
#define VICVectAddr27		(*(volatile uint32_t*)(0xFFFFF16C))
#define VICVectAddr28		(*(volatile uint32_t*)(0xFFFFF170))
#define VICVectAddr29		(*(volatile uint32_t*)(0xFFFFF174))
#define VICVectAddr30		(*(volatile uint32_t*)(0xFFFFF178))
#define VICVectAddr31		(*(volatile uint32_t*)(0xFFFFF17C))
#define VICVectCntl0		(*(volatile uint32_t*)(0xFFFFF200))
#define VICVectCntl1		(*(volatile uint32_t*)(0xFFFFF204))
#define VICVectCntl2		(*(volatile uint32_t*)(0xFFFFF208))
#define VICVectCntl3		(*(volatile uint32_t*)(0xFFFFF20C))
#define VICVectCntl4		(*(volatile uint32_t*)(0xFFFFF210))
#define VICVectCntl5		(*(volatile uint32_t*)(0xFFFFF214))
#define VICVectCntl6		(*(volatile uint32_t*)(0xFFFFF218))
#define VICVectCntl7		(*(volatile uint32_t*)(0xFFFFF21C))
#define VICVectCntl8		(*(volatile uint32_t*)(0xFFFFF220))
#define VICVectCntl9		(*(volatile uint32_t*)(0xFFFFF224))
#define VICVectCntl10		(*(volatile uint32_t*)(0xFFFFF228))
#define VICVectCntl11		(*(volatile uint32_t*)(0xFFFFF22C))
#define VICVectCntl12		(*(volatile uint32_t*)(0xFFFFF230))
#define VICVectCntl13		(*(volatile uint32_t*)(0xFFFFF234))
#define VICVectCntl14		(*(volatile uint32_t*)(0xFFFFF238))
#define VICVectCntl15		(*(volatile uint32_t*)(0xFFFFF23C))
#define VICVectCntl16		(*(volatile uint32_t*)(0xFFFFF240))
#define VICVectCntl17		(*(volatile uint32_t*)(0xFFFFF244))
#define VICVectCntl18		(*(volatile uint32_t*)(0xFFFFF248))
#define VICVectCntl19		(*(volatile uint32_t*)(0xFFFFF24C))
#define VICVectCntl20		(*(volatile uint32_t*)(0xFFFFF250))
#define VICVectCntl21		(*(volatile uint32_t*)(0xFFFFF254))
#define VICVectCntl22		(*(volatile uint32_t*)(0xFFFFF258))
#define VICVectCntl23		(*(volatile uint32_t*)(0xFFFFF25C))
#define VICVectCntl24		(*(volatile uint32_t*)(0xFFFFF260))
#define VICVectCntl25		(*(volatile uint32_t*)(0xFFFFF264))
#define VICVectCntl26		(*(volatile uint32_t*)(0xFFFFF268))
#define VICVectCntl27		(*(volatile uint32_t*)(0xFFFFF26C))
#define VICVectCntl28		(*(volatile uint32_t*)(0xFFFFF270))
#define VICVectCntl29		(*(volatile uint32_t*)(0xFFFFF274))
#define VICVectCntl30		(*(volatile uint32_t*)(0xFFFFF278))
#define VICVectCntl31		(*(volatile uint32_t*)(0xFFFFF27C))
#define VICVectAddr			(*(volatile uint32_t*)(0xFFFFFF00))

#define PINSEL				( (volatile uint32_t*)(0xE002C000))
#define PINSEL0				(*(volatile uint32_t*)(0xE002C000))
#define PINSEL1				(*(volatile uint32_t*)(0xE002C004))
#define PINSEL2				(*(volatile uint32_t*)(0xE002C008))
#define PINSEL3				(*(volatile uint32_t*)(0xE002C00C))
#define PINSEL4				(*(volatile uint32_t*)(0xE002C010))
#define PINSEL5				(*(volatile uint32_t*)(0xE002C014))
#define PINSEL6				(*(volatile uint32_t*)(0xE002C018))
#define PINSEL7				(*(volatile uint32_t*)(0xE002C01C))
#define PINSEL8				(*(volatile uint32_t*)(0xE002C020))
#define PINSEL9				(*(volatile uint32_t*)(0xE002C024))
#define PINSEL10			(*(volatile uint32_t*)(0xE002C028))

#define PINMODE				( (volatile uint32_t*)(0xE002C040))
#define PINMODE0			(*(volatile uint32_t*)(0xE002C040))
#define PINMODE1			(*(volatile uint32_t*)(0xE002C044))
#define PINMODE2			(*(volatile uint32_t*)(0xE002C048))
#define PINMODE3			(*(volatile uint32_t*)(0xE002C04C))
#define PINMODE4			(*(volatile uint32_t*)(0xE002C050))
#define PINMODE5			(*(volatile uint32_t*)(0xE002C054))
#define PINMODE6			(*(volatile uint32_t*)(0xE002C058))
#define PINMODE7			(*(volatile uint32_t*)(0xE002C05C))
#define PINMODE8			(*(volatile uint32_t*)(0xE002C060))
#define PINMODE9			(*(volatile uint32_t*)(0xE002C064))

#define IOPIN0				(*(volatile uint32_t*)(0xE0028000))
#define IOSET0				(*(volatile uint32_t*)(0xE0028004))
#define IODIR0				(*(volatile uint32_t*)(0xE0028008))
#define IOCLR0				(*(volatile uint32_t*)(0xE002800C))
#define IOPIN1				(*(volatile uint32_t*)(0xE0028010))
#define IOSET1				(*(volatile uint32_t*)(0xE0028014))
#define IODIR1				(*(volatile uint32_t*)(0xE0028018))
#define IOCLR1				(*(volatile uint32_t*)(0xE002801C))

#define IO0_INT_EN_R		(*(volatile uint32_t*)(0xE0028090))
#define IO0_INT_EN_F		(*(volatile uint32_t*)(0xE0028094))
#define IO0_INT_STAT_R		(*(volatile uint32_t*)(0xE0028084))
#define IO0_INT_STAT_F		(*(volatile uint32_t*)(0xE0028088))
#define IO0_INT_CLR			(*(volatile uint32_t*)(0xE002808C))
#define IO2_INT_EN_R		(*(volatile uint32_t*)(0xE00280B0))
#define IO2_INT_EN_F		(*(volatile uint32_t*)(0xE00280B4))
#define IO2_INT_STAT_R		(*(volatile uint32_t*)(0xE00280A4))
#define IO2_INT_STAT_F		(*(volatile uint32_t*)(0xE00280A8))
#define IO2_INT_CLR			(*(volatile uint32_t*)(0xE00280AC))
#define IO_INT_STAT			(*(volatile uint32_t*)(0xE0028080))

#define PARTCFG				(*(volatile uint32_t*)(0x3FFF8000))

