Zarh/ManaGunZ/MGZ/lib/fatfs/ffsample/lpc23xx/LPC2300.h
#define FIO0DIR				(*(volatile uint32_t*)(0x3FFFC000))
#define FIO0DIRL			(*(volatile uint16_t*)(0x3FFFC000))
#define FIO0DIRU			(*(volatile uint16_t*)(0x3FFFC002))
#define FIO0DIR0			(*(volatile uint8_t*)(0x3FFFC000))
#define FIO0DIR1			(*(volatile uint8_t*)(0x3FFFC001))
#define FIO0DIR2			(*(volatile uint8_t*)(0x3FFFC002))
#define FIO0DIR3			(*(volatile uint8_t*)(0x3FFFC003))

#define FIO0MASK			(*(volatile uint32_t*)(0x3FFFC010))
#define FIO0MASKL			(*(volatile uint16_t*)(0x3FFFC010))
#define FIO0MASKU			(*(volatile uint16_t*)(0x3FFFC012))
#define FIO0MASK0			(*(volatile uint8_t*)(0x3FFFC010))
#define FIO0MASK1			(*(volatile uint8_t*)(0x3FFFC011))
#define FIO0MASK2			(*(volatile uint8_t*)(0x3FFFC012))
#define FIO0MASK3			(*(volatile uint8_t*)(0x3FFFC013))

#define FIO0PIN				(*(volatile uint32_t*)(0x3FFFC014))
#define FIO0PINL			(*(volatile uint16_t*)(0x3FFFC014))
#define FIO0PINU			(*(volatile uint16_t*)(0x3FFFC016))
#define FIO0PIN0			(*(volatile uint8_t*)(0x3FFFC014))
#define FIO0PIN1			(*(volatile uint8_t*)(0x3FFFC015))
#define FIO0PIN2			(*(volatile uint8_t*)(0x3FFFC016))
#define FIO0PIN3			(*(volatile uint8_t*)(0x3FFFC017))

#define FIO0SET				(*(volatile uint32_t*)(0x3FFFC018))
#define FIO0SETL			(*(volatile uint16_t*)(0x3FFFC018))
#define FIO0SETU			(*(volatile uint16_t*)(0x3FFFC01A))
#define FIO0SET0			(*(volatile uint8_t*)(0x3FFFC018))
#define FIO0SET1			(*(volatile uint8_t*)(0x3FFFC019))
#define FIO0SET2			(*(volatile uint8_t*)(0x3FFFC01A))
#define FIO0SET3			(*(volatile uint8_t*)(0x3FFFC01B))

#define FIO0CLR				(*(volatile uint32_t*)(0x3FFFC01C))
#define FIO0CLRL			(*(volatile uint16_t*)(0x3FFFC01C))
#define FIO0CLRU			(*(volatile uint16_t*)(0x3FFFC01E))
#define FIO0CLR0			(*(volatile uint8_t*)(0x3FFFC01C))
#define FIO0CLR1			(*(volatile uint8_t*)(0x3FFFC01D))
#define FIO0CLR2			(*(volatile uint8_t*)(0x3FFFC01E))
#define FIO0CLR3			(*(volatile uint8_t*)(0x3FFFC01F))

#define FIO1DIR				(*(volatile uint32_t*)(0x3FFFC020))
#define FIO1DIRL			(*(volatile uint16_t*)(0x3FFFC020))
#define FIO1DIRU			(*(volatile uint16_t*)(0x3FFFC022))
#define FIO1DIR0			(*(volatile uint8_t*)(0x3FFFC020))
#define FIO1DIR1			(*(volatile uint8_t*)(0x3FFFC021))
#define FIO1DIR2			(*(volatile uint8_t*)(0x3FFFC022))
#define FIO1DIR3			(*(volatile uint8_t*)(0x3FFFC023))

#define FIO1MASK			(*(volatile uint32_t*)(0x3FFFC030))
#define FIO1MASKL			(*(volatile uint16_t*)(0x3FFFC030))
#define FIO1MASKU			(*(volatile uint16_t*)(0x3FFFC032))
#define FIO1MASK0			(*(volatile uint8_t*)(0x3FFFC030))
#define FIO1MASK1			(*(volatile uint8_t*)(0x3FFFC021))
#define FIO1MASK2			(*(volatile uint8_t*)(0x3FFFC032))
#define FIO1MASK3			(*(volatile uint8_t*)(0x3FFFC033))

#define FIO1PIN				(*(volatile uint32_t*)(0x3FFFC034))
#define FIO1PINL			(*(volatile uint16_t*)(0x3FFFC034))
#define FIO1PINU			(*(volatile uint16_t*)(0x3FFFC036))
#define FIO1PIN0			(*(volatile uint8_t*)(0x3FFFC034))
#define FIO1PIN1			(*(volatile uint8_t*)(0x3FFFC025))
#define FIO1PIN2			(*(volatile uint8_t*)(0x3FFFC036))
#define FIO1PIN3			(*(volatile uint8_t*)(0x3FFFC037))

#define FIO1SET				(*(volatile uint32_t*)(0x3FFFC038))
#define FIO1SETL			(*(volatile uint16_t*)(0x3FFFC038))
#define FIO1SETU			(*(volatile uint16_t*)(0x3FFFC03A))
#define FIO1SET0			(*(volatile uint8_t*)(0x3FFFC038))
#define FIO1SET1			(*(volatile uint8_t*)(0x3FFFC029))
#define FIO1SET2			(*(volatile uint8_t*)(0x3FFFC03A))
#define FIO1SET3			(*(volatile uint8_t*)(0x3FFFC03B))

#define FIO1CLR				(*(volatile uint32_t*)(0x3FFFC03C))
#define FIO1CLRL			(*(volatile uint16_t*)(0x3FFFC03C))
#define FIO1CLRU			(*(volatile uint16_t*)(0x3FFFC03E))
#define FIO1CLR0			(*(volatile uint8_t*)(0x3FFFC03C))
#define FIO1CLR1			(*(volatile uint8_t*)(0x3FFFC02D))
#define FIO1CLR2			(*(volatile uint8_t*)(0x3FFFC03E))
#define FIO1CLR3			(*(volatile uint8_t*)(0x3FFFC03F))

#define FIO2DIR				(*(volatile uint32_t*)(0x3FFFC040))
#define FIO2DIRL			(*(volatile uint16_t*)(0x3FFFC040))
#define FIO2DIRU			(*(volatile uint16_t*)(0x3FFFC042))
#define FIO2DIR0			(*(volatile uint8_t*)(0x3FFFC040))
#define FIO2DIR1			(*(volatile uint8_t*)(0x3FFFC041))
#define FIO2DIR2			(*(volatile uint8_t*)(0x3FFFC042))
#define FIO2DIR3			(*(volatile uint8_t*)(0x3FFFC043))

#define FIO2MASK			(*(volatile uint32_t*)(0x3FFFC050))
#define FIO2MASKL			(*(volatile uint16_t*)(0x3FFFC050))
#define FIO2MASKU			(*(volatile uint16_t*)(0x3FFFC052))
#define FIO2MASK0			(*(volatile uint8_t*)(0x3FFFC050))
#define FIO2MASK1			(*(volatile uint8_t*)(0x3FFFC051))
#define FIO2MASK2			(*(volatile uint8_t*)(0x3FFFC052))
#define FIO2MASK3			(*(volatile uint8_t*)(0x3FFFC053))

#define FIO2PIN				(*(volatile uint32_t*)(0x3FFFC054))
#define FIO2PINL			(*(volatile uint16_t*)(0x3FFFC054))
#define FIO2PINU			(*(volatile uint16_t*)(0x3FFFC056))
#define FIO2PIN0			(*(volatile uint8_t*)(0x3FFFC054))
#define FIO2PIN1			(*(volatile uint8_t*)(0x3FFFC055))
#define FIO2PIN2			(*(volatile uint8_t*)(0x3FFFC056))
#define FIO2PIN3			(*(volatile uint8_t*)(0x3FFFC057))

#define FIO2SET				(*(volatile uint32_t*)(0x3FFFC058))
#define FIO2SETL			(*(volatile uint16_t*)(0x3FFFC058))
#define FIO2SETU			(*(volatile uint16_t*)(0x3FFFC05A))
#define FIO2SET0			(*(volatile uint8_t*)(0x3FFFC058))
#define FIO2SET1			(*(volatile uint8_t*)(0x3FFFC059))
#define FIO2SET2			(*(volatile uint8_t*)(0x3FFFC05A))
#define FIO2SET3			(*(volatile uint8_t*)(0x3FFFC05B))

#define FIO2CLR				(*(volatile uint32_t*)(0x3FFFC05C))
#define FIO2CLRL			(*(volatile uint16_t*)(0x3FFFC05C))
#define FIO2CLRU			(*(volatile uint16_t*)(0x3FFFC05E))
#define FIO2CLR0			(*(volatile uint8_t*)(0x3FFFC05C))
#define FIO2CLR1			(*(volatile uint8_t*)(0x3FFFC05D))
#define FIO2CLR2			(*(volatile uint8_t*)(0x3FFFC05E))
#define FIO2CLR3			(*(volatile uint8_t*)(0x3FFFC05F))

#define FIO3DIR				(*(volatile uint32_t*)(0x3FFFC060))
#define FIO3DIRL			(*(volatile uint16_t*)(0x3FFFC060))
#define FIO3DIRU			(*(volatile uint16_t*)(0x3FFFC062))
#define FIO3DIR0			(*(volatile uint8_t*)(0x3FFFC060))
#define FIO3DIR1			(*(volatile uint8_t*)(0x3FFFC061))
#define FIO3DIR2			(*(volatile uint8_t*)(0x3FFFC062))
#define FIO3DIR3			(*(volatile uint8_t*)(0x3FFFC063))

