Zarh/ManaGunZ/MGZ/lib/fatfs/ffsample/lpc23xx/LPC2300.h
#define FIO3MASK			(*(volatile uint32_t*)(0x3FFFC070))
#define FIO3MASKL			(*(volatile uint16_t*)(0x3FFFC070))
#define FIO3MASKU			(*(volatile uint16_t*)(0x3FFFC072))
#define FIO3MASK0			(*(volatile uint8_t*)(0x3FFFC070))
#define FIO3MASK1			(*(volatile uint8_t*)(0x3FFFC071))
#define FIO3MASK2			(*(volatile uint8_t*)(0x3FFFC072))
#define FIO3MASK3			(*(volatile uint8_t*)(0x3FFFC073))

#define FIO3PIN				(*(volatile uint32_t*)(0x3FFFC074))
#define FIO3PINL			(*(volatile uint16_t*)(0x3FFFC074))
#define FIO3PINU			(*(volatile uint16_t*)(0x3FFFC076))
#define FIO3PIN0			(*(volatile uint8_t*)(0x3FFFC074))
#define FIO3PIN1			(*(volatile uint8_t*)(0x3FFFC075))
#define FIO3PIN2			(*(volatile uint8_t*)(0x3FFFC076))
#define FIO3PIN3			(*(volatile uint8_t*)(0x3FFFC077))

#define FIO3SET				(*(volatile uint32_t*)(0x3FFFC078))
#define FIO3SETL			(*(volatile uint16_t*)(0x3FFFC078))
#define FIO3SETU			(*(volatile uint16_t*)(0x3FFFC07A))
#define FIO3SET0			(*(volatile uint8_t*)(0x3FFFC078))
#define FIO3SET1			(*(volatile uint8_t*)(0x3FFFC079))
#define FIO3SET2			(*(volatile uint8_t*)(0x3FFFC07A))
#define FIO3SET3			(*(volatile uint8_t*)(0x3FFFC07B))

#define FIO3CLR				(*(volatile uint32_t*)(0x3FFFC07C))
#define FIO3CLRL			(*(volatile uint16_t*)(0x3FFFC07C))
#define FIO3CLRU			(*(volatile uint16_t*)(0x3FFFC07E))
#define FIO3CLR0			(*(volatile uint8_t*)(0x3FFFC07C))
#define FIO3CLR1			(*(volatile uint8_t*)(0x3FFFC07D))
#define FIO3CLR2			(*(volatile uint8_t*)(0x3FFFC07E))
#define FIO3CLR3			(*(volatile uint8_t*)(0x3FFFC07F))

#define FIO4DIR				(*(volatile uint32_t*)(0x3FFFC080))
#define FIO4DIRL			(*(volatile uint16_t*)(0x3FFFC080))
#define FIO4DIRU			(*(volatile uint16_t*)(0x3FFFC082))
#define FIO4DIR0			(*(volatile uint8_t*)(0x3FFFC080))
#define FIO4DIR1			(*(volatile uint8_t*)(0x3FFFC081))
#define FIO4DIR2			(*(volatile uint8_t*)(0x3FFFC082))
#define FIO4DIR3			(*(volatile uint8_t*)(0x3FFFC083))

#define FIO4MASK			(*(volatile uint32_t*)(0x3FFFC090))
#define FIO4MASKL			(*(volatile uint16_t*)(0x3FFFC090))
#define FIO4MASKU			(*(volatile uint16_t*)(0x3FFFC092))
#define FIO4MASK0			(*(volatile uint8_t*)(0x3FFFC090))
#define FIO4MASK1			(*(volatile uint8_t*)(0x3FFFC091))
#define FIO4MASK2			(*(volatile uint8_t*)(0x3FFFC092))
#define FIO4MASK3			(*(volatile uint8_t*)(0x3FFFC093))

#define FIO4PIN				(*(volatile uint32_t*)(0x3FFFC094))
#define FIO4PINL			(*(volatile uint16_t*)(0x3FFFC094))
#define FIO4PINU			(*(volatile uint16_t*)(0x3FFFC096))
#define FIO4PIN0			(*(volatile uint8_t*)(0x3FFFC094))
#define FIO4PIN1			(*(volatile uint8_t*)(0x3FFFC095))
#define FIO4PIN2			(*(volatile uint8_t*)(0x3FFFC096))
#define FIO4PIN3			(*(volatile uint8_t*)(0x3FFFC097))

#define FIO4SET				(*(volatile uint32_t*)(0x3FFFC098))
#define FIO4SETL			(*(volatile uint16_t*)(0x3FFFC098))
#define FIO4SETU			(*(volatile uint16_t*)(0x3FFFC09A))
#define FIO4SET0			(*(volatile uint8_t*)(0x3FFFC098))
#define FIO4SET1			(*(volatile uint8_t*)(0x3FFFC099))
#define FIO4SET2			(*(volatile uint8_t*)(0x3FFFC09A))
#define FIO4SET3			(*(volatile uint8_t*)(0x3FFFC09B))

#define FIO4CLR				(*(volatile uint32_t*)(0x3FFFC09C))
#define FIO4CLRL			(*(volatile uint16_t*)(0x3FFFC09C))
#define FIO4CLRU			(*(volatile uint16_t*)(0x3FFFC09E))
#define FIO4CLR0			(*(volatile uint8_t*)(0x3FFFC09C))
#define FIO4CLR1			(*(volatile uint8_t*)(0x3FFFC09D))
#define FIO4CLR2			(*(volatile uint8_t*)(0x3FFFC09E))
#define FIO4CLR3			(*(volatile uint8_t*)(0x3FFFC09F))

#define MAMCR				(*(volatile uint32_t*)(0xE01FC000))
#define MAMTIM				(*(volatile uint32_t*)(0xE01FC004))
#define MEMMAP				(*(volatile uint32_t*)(0xE01FC040))

#define PLLCON				(*(volatile uint32_t*)(0xE01FC080))
#define PLLCFG				(*(volatile uint32_t*)(0xE01FC084))
#define PLLSTAT				(*(volatile uint32_t*)(0xE01FC088))
#define PLLFEED				(*(volatile uint32_t*)(0xE01FC08C))

#define PCON				(*(volatile uint32_t*)(0xE01FC0C0))
#define PCONP				(*(volatile uint32_t*)(0xE01FC0C4))

#define CCLKCFG				(*(volatile uint32_t*)(0xE01FC104))
#define USBCLKCFG			(*(volatile uint32_t*)(0xE01FC108))
#define CLKSRCSEL			(*(volatile uint32_t*)(0xE01FC10C))
#define PCLKSEL				( (volatile uint32_t*)(0xE01FC1A8))
#define PCLKSEL0			(*(volatile uint32_t*)(0xE01FC1A8))
#define PCLKSEL1			(*(volatile uint32_t*)(0xE01FC1AC))

#define EXTINT				(*(volatile uint32_t*)(0xE01FC140))
#define INTWAKE				(*(volatile uint32_t*)(0xE01FC144))
#define EXTMODE				(*(volatile uint32_t*)(0xE01FC148))
#define EXTPOLAR			(*(volatile uint32_t*)(0xE01FC14C))

#define RSIR				(*(volatile uint32_t*)(0xE01FC180))

#define CSPR				(*(volatile uint32_t*)(0xE01FC184))

#define AHBCFG1				(*(volatile uint32_t*)(0xE01FC188))
#define AHBCFG2				(*(volatile uint32_t*)(0xE01FC18C))

#define SCS					(*(volatile uint32_t*)(0xE01FC1A0))

#define EMC_CTRL			(*(volatile uint32_t*)(0xFFE08000))
#define EMC_STAT			(*(volatile uint32_t*)(0xFFE08004))
#define EMC_CONFIG			(*(volatile uint32_t*)(0xFFE08008))

#define EMC_DYN_CTRL		(*(volatile uint32_t*)(0xFFE08020))
#define EMC_DYN_RFSH		(*(volatile uint32_t*)(0xFFE08024))
#define EMC_DYN_RD_CFG		(*(volatile uint32_t*)(0xFFE08028))
#define EMC_DYN_RP			(*(volatile uint32_t*)(0xFFE08030))
#define EMC_DYN_RAS			(*(volatile uint32_t*)(0xFFE08034))
#define EMC_DYN_SREX		(*(volatile uint32_t*)(0xFFE08038))
#define EMC_DYN_APR			(*(volatile uint32_t*)(0xFFE0803C))
#define EMC_DYN_DAL			(*(volatile uint32_t*)(0xFFE08040))
#define EMC_DYN_WR			(*(volatile uint32_t*)(0xFFE08044))
#define EMC_DYN_RC			(*(volatile uint32_t*)(0xFFE08048))
#define EMC_DYN_RFC			(*(volatile uint32_t*)(0xFFE0804C))
#define EMC_DYN_XSR			(*(volatile uint32_t*)(0xFFE08050))
#define EMC_DYN_RRD			(*(volatile uint32_t*)(0xFFE08054))
#define EMC_DYN_MRD			(*(volatile uint32_t*)(0xFFE08058))

#define EMC_DYN_CFG0		(*(volatile uint32_t*)(0xFFE08100))
#define EMC_DYN_RASCAS0		(*(volatile uint32_t*)(0xFFE08104))
#define EMC_DYN_CFG1		(*(volatile uint32_t*)(0xFFE08140))
#define EMC_DYN_RASCAS1		(*(volatile uint32_t*)(0xFFE08144))
#define EMC_DYN_CFG2		(*(volatile uint32_t*)(0xFFE08160))
#define EMC_DYN_RASCAS2		(*(volatile uint32_t*)(0xFFE08164))
#define EMC_DYN_CFG3		(*(volatile uint32_t*)(0xFFE08180))
#define EMC_DYN_RASCAS3		(*(volatile uint32_t*)(0xFFE08184))

#define EMC_STA_CFG0		(*(volatile uint32_t*)(0xFFE08200))
#define EMC_STA_WAITWEN0	(*(volatile uint32_t*)(0xFFE08204))
#define EMC_STA_WAITOEN0	(*(volatile uint32_t*)(0xFFE08208))
#define EMC_STA_WAITRD0		(*(volatile uint32_t*)(0xFFE0820C))
#define EMC_STA_WAITPAGE0	(*(volatile uint32_t*)(0xFFE08210))
#define EMC_STA_WAITWR0		(*(volatile uint32_t*)(0xFFE08214))
#define EMC_STA_WAITTURN0	(*(volatile uint32_t*)(0xFFE08218))

