Zarh/ManaGunZ/MGZ/lib/fatfs/ffsample/lpc23xx/LPC2300.h
#define EMC_STA_CFG1		(*(volatile uint32_t*)(0xFFE08220))
#define EMC_STA_WAITWEN1	(*(volatile uint32_t*)(0xFFE08224))
#define EMC_STA_WAITOEN1	(*(volatile uint32_t*)(0xFFE08228))
#define EMC_STA_WAITRD1		(*(volatile uint32_t*)(0xFFE0822C))
#define EMC_STA_WAITPAGE1	(*(volatile uint32_t*)(0xFFE08230))
#define EMC_STA_WAITWR1		(*(volatile uint32_t*)(0xFFE08234))
#define EMC_STA_WAITTURN1	(*(volatile uint32_t*)(0xFFE08238))

#define EMC_STA_CFG2		(*(volatile uint32_t*)(0xFFE08240))
#define EMC_STA_WAITWEN2	(*(volatile uint32_t*)(0xFFE08244))
#define EMC_STA_WAITOEN2	(*(volatile uint32_t*)(0xFFE08248))
#define EMC_STA_WAITRD2		(*(volatile uint32_t*)(0xFFE0824C))
#define EMC_STA_WAITPAGE2	(*(volatile uint32_t*)(0xFFE08250))
#define EMC_STA_WAITWR2		(*(volatile uint32_t*)(0xFFE08254))
#define EMC_STA_WAITTURN2	(*(volatile uint32_t*)(0xFFE08258))

#define EMC_STA_CFG3		(*(volatile uint32_t*)(0xFFE08260))
#define EMC_STA_WAITWEN3	(*(volatile uint32_t*)(0xFFE08264))
#define EMC_STA_WAITOEN3	(*(volatile uint32_t*)(0xFFE08268))
#define EMC_STA_WAITRD3		(*(volatile uint32_t*)(0xFFE0826C))
#define EMC_STA_WAITPAGE3	(*(volatile uint32_t*)(0xFFE08270))
#define EMC_STA_WAITWR3		(*(volatile uint32_t*)(0xFFE08274))
#define EMC_STA_WAITTURN3	(*(volatile uint32_t*)(0xFFE08278))

#define EMC_STA_EXT_WAIT	(*(volatile uint32_t*)(0xFFE08880))

#define T0IR				(*(volatile uint32_t*)(0xE0004000))
#define T0TCR				(*(volatile uint32_t*)(0xE0004004))
#define T0TC				(*(volatile uint32_t*)(0xE0004008))
#define T0PR				(*(volatile uint32_t*)(0xE000400C))
#define T0PC				(*(volatile uint32_t*)(0xE0004010))
#define T0MCR				(*(volatile uint32_t*)(0xE0004014))
#define T0MR0				(*(volatile uint32_t*)(0xE0004018))
#define T0MR1				(*(volatile uint32_t*)(0xE000401C))
#define T0MR2				(*(volatile uint32_t*)(0xE0004020))
#define T0MR3				(*(volatile uint32_t*)(0xE0004024))
#define T0CCR				(*(volatile uint32_t*)(0xE0004028))
#define T0CR0				(*(volatile uint32_t*)(0xE000402C))
#define T0CR1				(*(volatile uint32_t*)(0xE0004030))
#define T0CR2				(*(volatile uint32_t*)(0xE0004034))
#define T0CR3				(*(volatile uint32_t*)(0xE0004038))
#define T0EMR				(*(volatile uint32_t*)(0xE000403C))
#define T0CTCR				(*(volatile uint32_t*)(0xE0004070))

#define T1IR				(*(volatile uint32_t*)(0xE0008000))
#define T1TCR				(*(volatile uint32_t*)(0xE0008004))
#define T1TC				(*(volatile uint32_t*)(0xE0008008))
#define T1PR				(*(volatile uint32_t*)(0xE000800C))
#define T1PC				(*(volatile uint32_t*)(0xE0008010))
#define T1MCR				(*(volatile uint32_t*)(0xE0008014))
#define T1MR0				(*(volatile uint32_t*)(0xE0008018))
#define T1MR1				(*(volatile uint32_t*)(0xE000801C))
#define T1MR2				(*(volatile uint32_t*)(0xE0008020))
#define T1MR3				(*(volatile uint32_t*)(0xE0008024))
#define T1CCR				(*(volatile uint32_t*)(0xE0008028))
#define T1CR0				(*(volatile uint32_t*)(0xE000802C))
#define T1CR1				(*(volatile uint32_t*)(0xE0008030))
#define T1CR2				(*(volatile uint32_t*)(0xE0008034))
#define T1CR3				(*(volatile uint32_t*)(0xE0008038))
#define T1EMR				(*(volatile uint32_t*)(0xE000803C))
#define T1CTCR				(*(volatile uint32_t*)(0xE0008070))

#define T2IR				(*(volatile uint32_t*)(0xE0070000))
#define T2TCR				(*(volatile uint32_t*)(0xE0070004))
#define T2TC				(*(volatile uint32_t*)(0xE0070008))
#define T2PR				(*(volatile uint32_t*)(0xE007000C))
#define T2PC				(*(volatile uint32_t*)(0xE0070010))
#define T2MCR				(*(volatile uint32_t*)(0xE0070014))
#define T2MR0				(*(volatile uint32_t*)(0xE0070018))
#define T2MR1				(*(volatile uint32_t*)(0xE007001C))
#define T2MR2				(*(volatile uint32_t*)(0xE0070020))
#define T2MR3				(*(volatile uint32_t*)(0xE0070024))
#define T2CCR				(*(volatile uint32_t*)(0xE0070028))
#define T2CR0				(*(volatile uint32_t*)(0xE007002C))
#define T2CR1				(*(volatile uint32_t*)(0xE0070030))
#define T2CR2				(*(volatile uint32_t*)(0xE0070034))
#define T2CR3				(*(volatile uint32_t*)(0xE0070038))
#define T2EMR				(*(volatile uint32_t*)(0xE007003C))
#define T2CTCR				(*(volatile uint32_t*)(0xE0070070))

#define T3IR				(*(volatile uint32_t*)(0xE0074000))
#define T3TCR				(*(volatile uint32_t*)(0xE0074004))
#define T3TC				(*(volatile uint32_t*)(0xE0074008))
#define T3PR				(*(volatile uint32_t*)(0xE007400C))
#define T3PC				(*(volatile uint32_t*)(0xE0074010))
#define T3MCR				(*(volatile uint32_t*)(0xE0074014))
#define T3MR0				(*(volatile uint32_t*)(0xE0074018))
#define T3MR1				(*(volatile uint32_t*)(0xE007401C))
#define T3MR2				(*(volatile uint32_t*)(0xE0074020))
#define T3MR3				(*(volatile uint32_t*)(0xE0074024))
#define T3CCR				(*(volatile uint32_t*)(0xE0074028))
#define T3CR0				(*(volatile uint32_t*)(0xE007402C))
#define T3CR1				(*(volatile uint32_t*)(0xE0074030))
#define T3CR2				(*(volatile uint32_t*)(0xE0074034))
#define T3CR3				(*(volatile uint32_t*)(0xE0074038))
#define T3EMR				(*(volatile uint32_t*)(0xE007403C))
#define T3CTCR				(*(volatile uint32_t*)(0xE0074070))

#define PWM0IR				(*(volatile uint32_t*)(0xE0014000))
#define PWM0TCR				(*(volatile uint32_t*)(0xE0014004))
#define PWM0TC				(*(volatile uint32_t*)(0xE0014008))
#define PWM0PR				(*(volatile uint32_t*)(0xE001400C))
#define PWM0PC				(*(volatile uint32_t*)(0xE0014010))
#define PWM0MCR				(*(volatile uint32_t*)(0xE0014014))
#define PWM0MR0				(*(volatile uint32_t*)(0xE0014018))
#define PWM0MR1				(*(volatile uint32_t*)(0xE001401C))
#define PWM0MR2				(*(volatile uint32_t*)(0xE0014020))
#define PWM0MR3				(*(volatile uint32_t*)(0xE0014024))
#define PWM0CCR				(*(volatile uint32_t*)(0xE0014028))
#define PWM0CR0				(*(volatile uint32_t*)(0xE001402C))
#define PWM0CR1				(*(volatile uint32_t*)(0xE0014030))
#define PWM0CR2				(*(volatile uint32_t*)(0xE0014034))
#define PWM0CR3				(*(volatile uint32_t*)(0xE0014038))
#define PWM0EMR				(*(volatile uint32_t*)(0xE001403C))
#define PWM0MR4				(*(volatile uint32_t*)(0xE0014040))
#define PWM0MR5				(*(volatile uint32_t*)(0xE0014044))
#define PWM0MR6				(*(volatile uint32_t*)(0xE0014048))
#define PWM0PCR				(*(volatile uint32_t*)(0xE001404C))
#define PWM0LER				(*(volatile uint32_t*)(0xE0014050))
#define PWM0CTCR			(*(volatile uint32_t*)(0xE0014070))

