Zarh/ManaGunZ/MGZ/lib/fatfs/ffsample/lpc23xx/LPC2300.h
#define PWM1IR				(*(volatile uint32_t*)(0xE0018000))
#define PWM1TCR				(*(volatile uint32_t*)(0xE0018004))
#define PWM1TC				(*(volatile uint32_t*)(0xE0018008))
#define PWM1PR				(*(volatile uint32_t*)(0xE001800C))
#define PWM1PC				(*(volatile uint32_t*)(0xE0018010))
#define PWM1MCR				(*(volatile uint32_t*)(0xE0018014))
#define PWM1MR0				(*(volatile uint32_t*)(0xE0018018))
#define PWM1MR1				(*(volatile uint32_t*)(0xE001801C))
#define PWM1MR2				(*(volatile uint32_t*)(0xE0018020))
#define PWM1MR3				(*(volatile uint32_t*)(0xE0018024))
#define PWM1CCR				(*(volatile uint32_t*)(0xE0018028))
#define PWM1CR0				(*(volatile uint32_t*)(0xE001802C))
#define PWM1CR1				(*(volatile uint32_t*)(0xE0018030))
#define PWM1CR2				(*(volatile uint32_t*)(0xE0018034))
#define PWM1CR3				(*(volatile uint32_t*)(0xE0018038))
#define PWM1EMR				(*(volatile uint32_t*)(0xE001803C))
#define PWM1MR4				(*(volatile uint32_t*)(0xE0018040))
#define PWM1MR5				(*(volatile uint32_t*)(0xE0018044))
#define PWM1MR6				(*(volatile uint32_t*)(0xE0018048))
#define PWM1PCR				(*(volatile uint32_t*)(0xE001804C))
#define PWM1LER				(*(volatile uint32_t*)(0xE0018050))
#define PWM1CTCR			(*(volatile uint32_t*)(0xE0018070))

#define U0RBR				(*(volatile uint32_t*)(0xE000C000))
#define U0THR				(*(volatile uint32_t*)(0xE000C000))
#define U0DLL				(*(volatile uint32_t*)(0xE000C000))
#define U0DLM				(*(volatile uint32_t*)(0xE000C004))
#define U0IER				(*(volatile uint32_t*)(0xE000C004))
#define U0IIR				(*(volatile uint32_t*)(0xE000C008))
#define U0FCR				(*(volatile uint32_t*)(0xE000C008))
#define U0LCR				(*(volatile uint32_t*)(0xE000C00C))
#define U0LSR				(*(volatile uint32_t*)(0xE000C014))
#define U0SCR				(*(volatile uint32_t*)(0xE000C01C))
#define U0ACR				(*(volatile uint32_t*)(0xE000C020))
#define U0ICR				(*(volatile uint32_t*)(0xE000C024))
#define U0FDR				(*(volatile uint32_t*)(0xE000C028))
#define U0TER				(*(volatile uint32_t*)(0xE000C030))

#define U1RBR				(*(volatile uint32_t*)(0xE0010000))
#define U1THR				(*(volatile uint32_t*)(0xE0010000))
#define U1DLL				(*(volatile uint32_t*)(0xE0010000))
#define U1DLM				(*(volatile uint32_t*)(0xE0010004))
#define U1IER				(*(volatile uint32_t*)(0xE0010004))
#define U1IIR				(*(volatile uint32_t*)(0xE0010008))
#define U1FCR				(*(volatile uint32_t*)(0xE0010008))
#define U1LCR				(*(volatile uint32_t*)(0xE001000C))
#define U1MCR				(*(volatile uint32_t*)(0xE0010010))
#define U1LSR				(*(volatile uint32_t*)(0xE0010014))
#define U1MSR				(*(volatile uint32_t*)(0xE0010018))
#define U1SCR				(*(volatile uint32_t*)(0xE001001C))
#define U1ACR				(*(volatile uint32_t*)(0xE0010020))
#define U1FDR				(*(volatile uint32_t*)(0xE0010028))
#define U1TER				(*(volatile uint32_t*)(0xE0010030))

#define U2RBR				(*(volatile uint32_t*)(0xE0078000))
#define U2THR				(*(volatile uint32_t*)(0xE0078000))
#define U2DLL				(*(volatile uint32_t*)(0xE0078000))
#define U2DLM				(*(volatile uint32_t*)(0xE0078004))
#define U2IER				(*(volatile uint32_t*)(0xE0078004))
#define U2IIR				(*(volatile uint32_t*)(0xE0078008))
#define U2FCR				(*(volatile uint32_t*)(0xE0078008))
#define U2LCR				(*(volatile uint32_t*)(0xE007800C))
#define U2LSR				(*(volatile uint32_t*)(0xE0078014))
#define U2SCR				(*(volatile uint32_t*)(0xE007801C))
#define U2ACR				(*(volatile uint32_t*)(0xE0078020))
#define U2ICR				(*(volatile uint32_t*)(0xE0078024))
#define U2FDR				(*(volatile uint32_t*)(0xE0078028))
#define U2TER				(*(volatile uint32_t*)(0xE0078030))

#define U3RBR				(*(volatile uint32_t*)(0xE007C000))
#define U3THR				(*(volatile uint32_t*)(0xE007C000))
#define U3DLL				(*(volatile uint32_t*)(0xE007C000))
#define U3DLM				(*(volatile uint32_t*)(0xE007C004))
#define U3IER				(*(volatile uint32_t*)(0xE007C004))
#define U3IIR				(*(volatile uint32_t*)(0xE007C008))
#define U3FCR				(*(volatile uint32_t*)(0xE007C008))
#define U3LCR				(*(volatile uint32_t*)(0xE007C00C))
#define U3LSR				(*(volatile uint32_t*)(0xE007C014))
#define U3SCR				(*(volatile uint32_t*)(0xE007C01C))
#define U3ACR				(*(volatile uint32_t*)(0xE007C020))
#define U3ICR				(*(volatile uint32_t*)(0xE007C024))
#define U3FDR				(*(volatile uint32_t*)(0xE007C028))
#define U3TER				(*(volatile uint32_t*)(0xE007C030))

#define I20CONSET			(*(volatile uint32_t*)(0xE001C000))
#define I20STAT				(*(volatile uint32_t*)(0xE001C004))
#define I20DAT				(*(volatile uint32_t*)(0xE001C008))
#define I20ADR				(*(volatile uint32_t*)(0xE001C00C))
#define I20SCLH				(*(volatile uint32_t*)(0xE001C010))
#define I20SCLL				(*(volatile uint32_t*)(0xE001C014))
#define I20CONCLR			(*(volatile uint32_t*)(0xE001C018))

#define I21CONSET			(*(volatile uint32_t*)(0xE005C000))
#define I21STAT				(*(volatile uint32_t*)(0xE005C004))
#define I21DAT				(*(volatile uint32_t*)(0xE005C008))
#define I21ADR				(*(volatile uint32_t*)(0xE005C00C))
#define I21SCLH				(*(volatile uint32_t*)(0xE005C010))
#define I21SCLL				(*(volatile uint32_t*)(0xE005C014))
#define I21CONCLR			(*(volatile uint32_t*)(0xE005C018))

#define I22CONSET			(*(volatile uint32_t*)(0xE0080000))
#define I22STAT				(*(volatile uint32_t*)(0xE0080004))
#define I22DAT				(*(volatile uint32_t*)(0xE0080008))
#define I22ADR				(*(volatile uint32_t*)(0xE008000C))
#define I22SCLH				(*(volatile uint32_t*)(0xE0080010))
#define I22SCLL				(*(volatile uint32_t*)(0xE0080014))
#define I22CONCLR			(*(volatile uint32_t*)(0xE0080018))

#define S0SPCR				(*(volatile uint32_t*)(0xE0020000))
#define S0SPSR				(*(volatile uint32_t*)(0xE0020004))
#define S0SPDR				(*(volatile uint32_t*)(0xE0020008))
#define S0SPCCR				(*(volatile uint32_t*)(0xE002000C))
#define S0SPINT				(*(volatile uint32_t*)(0xE002001C))

#define SSP0CR0				(*(volatile uint32_t*)(0xE0068000))
#define SSP0CR1				(*(volatile uint32_t*)(0xE0068004))
#define SSP0DR				(*(volatile uint32_t*)(0xE0068008))
#define SSP0SR				(*(volatile uint32_t*)(0xE006800C))
#define SSP0CPSR			(*(volatile uint32_t*)(0xE0068010))
#define SSP0IMSC			(*(volatile uint32_t*)(0xE0068014))
#define SSP0RIS				(*(volatile uint32_t*)(0xE0068018))
#define SSP0MIS				(*(volatile uint32_t*)(0xE006801C))
#define SSP0ICR				(*(volatile uint32_t*)(0xE0068020))
#define SSP0DMACR			(*(volatile uint32_t*)(0xE0068024))

#define SSP1CR0				(*(volatile uint32_t*)(0xE0030000))
#define SSP1CR1				(*(volatile uint32_t*)(0xE0030004))
#define SSP1DR				(*(volatile uint32_t*)(0xE0030008))
#define SSP1SR				(*(volatile uint32_t*)(0xE003000C))
#define SSP1CPSR			(*(volatile uint32_t*)(0xE0030010))
#define SSP1IMSC			(*(volatile uint32_t*)(0xE0030014))
#define SSP1RIS				(*(volatile uint32_t*)(0xE0030018))
#define SSP1MIS				(*(volatile uint32_t*)(0xE003001C))
#define SSP1ICR				(*(volatile uint32_t*)(0xE0030020))
#define SSP1DMACR			(*(volatile uint32_t*)(0xE0030024))

