Zarh/ManaGunZ/MGZ/lib/fatfs/ffsample/lpc23xx/LPC2300.h
#define RTC_ILR				(*(volatile uint32_t*)(0xE0024000))
#define RTC_CTC				(*(volatile uint32_t*)(0xE0024004))
#define RTC_CCR				(*(volatile uint32_t*)(0xE0024008))
#define RTC_CIIR			(*(volatile uint32_t*)(0xE002400C))
#define RTC_AMR				(*(volatile uint32_t*)(0xE0024010))
#define RTC_CTIME0			(*(volatile uint32_t*)(0xE0024014))
#define RTC_CTIME1			(*(volatile uint32_t*)(0xE0024018))
#define RTC_CTIME2			(*(volatile uint32_t*)(0xE002401C))
#define RTC_SEC				(*(volatile uint32_t*)(0xE0024020))
#define RTC_MIN				(*(volatile uint32_t*)(0xE0024024))
#define RTC_HOUR			(*(volatile uint32_t*)(0xE0024028))
#define RTC_DOM				(*(volatile uint32_t*)(0xE002402C))
#define RTC_DOW				(*(volatile uint32_t*)(0xE0024030))
#define RTC_DOY				(*(volatile uint32_t*)(0xE0024034))
#define RTC_MONTH			(*(volatile uint32_t*)(0xE0024038))
#define RTC_YEAR			(*(volatile uint32_t*)(0xE002403C))
#define RTC_CISS			(*(volatile uint32_t*)(0xE0024040))
#define RTC_ALSEC			(*(volatile uint32_t*)(0xE0024060))
#define RTC_ALMIN			(*(volatile uint32_t*)(0xE0024064))
#define RTC_ALHOUR			(*(volatile uint32_t*)(0xE0024068))
#define RTC_ALDOM			(*(volatile uint32_t*)(0xE002406C))
#define RTC_ALDOW			(*(volatile uint32_t*)(0xE0024070))
#define RTC_ALDOY			(*(volatile uint32_t*)(0xE0024074))
#define RTC_ALMON			(*(volatile uint32_t*)(0xE0024078))
#define RTC_ALYEAR			(*(volatile uint32_t*)(0xE002407C))
#define RTC_PREINT			(*(volatile uint32_t*)(0xE0024080))
#define RTC_PREFRAC			(*(volatile uint32_t*)(0xE0024084))

#define AD0CR				(*(volatile uint32_t*)(0xE0034000))
#define AD0GDR				(*(volatile uint32_t*)(0xE0034004))
#define AD0INTEN			(*(volatile uint32_t*)(0xE003400C))
#define AD0DR0				(*(volatile uint32_t*)(0xE0034010))
#define AD0DR1				(*(volatile uint32_t*)(0xE0034014))
#define AD0DR2				(*(volatile uint32_t*)(0xE0034018))
#define AD0DR3				(*(volatile uint32_t*)(0xE003401C))
#define AD0DR4				(*(volatile uint32_t*)(0xE0034020))
#define AD0DR5				(*(volatile uint32_t*)(0xE0034024))
#define AD0DR6				(*(volatile uint32_t*)(0xE0034028))
#define AD0DR7				(*(volatile uint32_t*)(0xE003402C))
#define AD0STAT				(*(volatile uint32_t*)(0xE0034030))

#define DACR				(*(volatile uint32_t*)(0xE006C000))

#define WDMOD				(*(volatile uint32_t*)(0xE0000000))
#define WDTC				(*(volatile uint32_t*)(0xE0000004))
#define WDFEED				(*(volatile uint32_t*)(0xE0000008))
#define WDTV				(*(volatile uint32_t*)(0xE000000C))
#define WDCLKSEL			(*(volatile uint32_t*)(0xE0000010))

#define CAN_AFMR			(*(volatile uint32_t*)(0xE003C000))
#define CAN_SFF_SA			(*(volatile uint32_t*)(0xE003C004))
#define CAN_SFF_GRP_SA		(*(volatile uint32_t*)(0xE003C008))
#define CAN_EFF_SA			(*(volatile uint32_t*)(0xE003C00C))
#define CAN_EFF_GRP_SA		(*(volatile uint32_t*)(0xE003C010))
#define CAN_EOT				(*(volatile uint32_t*)(0xE003C014))
#define CAN_LUT_ERR_ADR		(*(volatile uint32_t*)(0xE003C018))
#define CAN_LUT_ERR			(*(volatile uint32_t*)(0xE003C01C))

#define CAN_TX_SR			(*(volatile uint32_t*)(0xE0040000))
#define CAN_RX_SR			(*(volatile uint32_t*)(0xE0040004))
#define CAN_MSR				(*(volatile uint32_t*)(0xE0040008))

#define CAN1MOD				(*(volatile uint32_t*)(0xE0044000))
#define CAN1CMR				(*(volatile uint32_t*)(0xE0044004))
#define CAN1GSR				(*(volatile uint32_t*)(0xE0044008))
#define CAN1ICR				(*(volatile uint32_t*)(0xE004400C))
#define CAN1IER				(*(volatile uint32_t*)(0xE0044010))
#define CAN1BTR				(*(volatile uint32_t*)(0xE0044014))
#define CAN1EWL				(*(volatile uint32_t*)(0xE0044018))
#define CAN1SR				(*(volatile uint32_t*)(0xE004401C))
#define CAN1RFS				(*(volatile uint32_t*)(0xE0044020))
#define CAN1RID				(*(volatile uint32_t*)(0xE0044024))
#define CAN1RDA				(*(volatile uint32_t*)(0xE0044028))
#define CAN1RDB				(*(volatile uint32_t*)(0xE004402C))

#define CAN1TFI1	 		(*(volatile uint32_t*)(0xE0044030))
#define CAN1TID1 			(*(volatile uint32_t*)(0xE0044034))
#define CAN1TDA1 			(*(volatile uint32_t*)(0xE0044038))
#define CAN1TDB1 			(*(volatile uint32_t*)(0xE004403C))
#define CAN1TFI2	 		(*(volatile uint32_t*)(0xE0044040))
#define CAN1TID2 			(*(volatile uint32_t*)(0xE0044044))
#define CAN1TDA2	 		(*(volatile uint32_t*)(0xE0044048))
#define CAN1TDB2 			(*(volatile uint32_t*)(0xE004404C))
#define CAN1TFI3	 		(*(volatile uint32_t*)(0xE0044050))
#define CAN1TID3 			(*(volatile uint32_t*)(0xE0044054))
#define CAN1TDA3	 		(*(volatile uint32_t*)(0xE0044058))
#define CAN1TDB3 			(*(volatile uint32_t*)(0xE004405C))

#define CAN2MOD				(*(volatile uint32_t*)(0xE0048000))
#define CAN2CMR 			(*(volatile uint32_t*)(0xE0048004))
#define CAN2GSR				(*(volatile uint32_t*)(0xE0048008))
#define CAN2ICR 			(*(volatile uint32_t*)(0xE004800C))
#define CAN2IER 			(*(volatile uint32_t*)(0xE0048010))
#define CAN2BTR 			(*(volatile uint32_t*)(0xE0048014))
#define CAN2EWL 			(*(volatile uint32_t*)(0xE0048018))
#define CAN2SR 				(*(volatile uint32_t*)(0xE004801C))
#define CAN2RFS 			(*(volatile uint32_t*)(0xE0048020))
#define CAN2RID 			(*(volatile uint32_t*)(0xE0048024))
#define CAN2RDA 			(*(volatile uint32_t*)(0xE0048028))
#define CAN2RDB 			(*(volatile uint32_t*)(0xE004802C))

#define CAN2TFI1			(*(volatile uint32_t*)(0xE0048030))
#define CAN2TID1			(*(volatile uint32_t*)(0xE0048034))
#define CAN2TDA1			(*(volatile uint32_t*)(0xE0048038))
#define CAN2TDB1			(*(volatile uint32_t*)(0xE004803C))
#define CAN2TFI2			(*(volatile uint32_t*)(0xE0048040))
#define CAN2TID2 			(*(volatile uint32_t*)(0xE0048044))
#define CAN2TDA2 			(*(volatile uint32_t*)(0xE0048048))
#define CAN2TDB2 			(*(volatile uint32_t*)(0xE004804C))
#define CAN2TFI3 			(*(volatile uint32_t*)(0xE0048050))
#define CAN2TID3 			(*(volatile uint32_t*)(0xE0048054))
#define CAN2TDA3 			(*(volatile uint32_t*)(0xE0048058))
#define CAN2TDB3 			(*(volatile uint32_t*)(0xE004805C))

#define MCI_POWER			(*(volatile uint32_t*)(0xE008C000))
#define MCI_CLOCK			(*(volatile uint32_t*)(0xE008C004))
#define MCI_ARGUMENT		(*(volatile uint32_t*)(0xE008C008))
#define MCI_COMMAND			(*(volatile uint32_t*)(0xE008C00C))
#define MCI_RESP_CMD		(*(volatile uint32_t*)(0xE008C010))
#define MCI_RESP0			(*(volatile uint32_t*)(0xE008C014))
#define MCI_RESP1			(*(volatile uint32_t*)(0xE008C018))
#define MCI_RESP2			(*(volatile uint32_t*)(0xE008C01C))
#define MCI_RESP3			(*(volatile uint32_t*)(0xE008C020))
#define MCI_DATA_TMR		(*(volatile uint32_t*)(0xE008C024))
#define MCI_DATA_LEN		(*(volatile uint32_t*)(0xE008C028))
#define MCI_DATA_CTRL		(*(volatile uint32_t*)(0xE008C02C))
#define MCI_DATA_CNT		(*(volatile uint32_t*)(0xE008C030))
#define MCI_STATUS			(*(volatile uint32_t*)(0xE008C034))
#define MCI_CLEAR			(*(volatile uint32_t*)(0xE008C038))
#define MCI_MASK0			(*(volatile uint32_t*)(0xE008C03C))
#define MCI_MASK1			(*(volatile uint32_t*)(0xE008C040))
#define MCI_FIFO_CNT		(*(volatile uint32_t*)(0xE008C048))
#define MCI_FIFO			(*(volatile uint32_t*)(0xE008C080))

#define I2S_DAO				(*(volatile uint32_t*)(0xE0088000))
#define I2S_DAI				(*(volatile uint32_t*)(0xE0088004))
#define I2S_TX_FIFO			(*(volatile uint32_t*)(0xE0088008))
#define I2S_RX_FIFO			(*(volatile uint32_t*)(0xE008800C))
#define I2S_STATE			(*(volatile uint32_t*)(0xE0088010))
#define I2S_DMA1			(*(volatile uint32_t*)(0xE0088014))
#define I2S_DMA2			(*(volatile uint32_t*)(0xE0088018))
#define I2S_IRQ				(*(volatile uint32_t*)(0xE008801C))
#define I2S_TXRATE			(*(volatile uint32_t*)(0xE0088020))
#define I2S_RXRATE			(*(volatile uint32_t*)(0xE0088024))

#define GPDMA_INT_STAT			(*(volatile uint32_t*)(0xFFE04000))
#define GPDMA_INT_TCSTAT		(*(volatile uint32_t*)(0xFFE04004))
#define GPDMA_INT_TCCLR			(*(volatile uint32_t*)(0xFFE04008))
#define GPDMA_INT_ERR_STAT		(*(volatile uint32_t*)(0xFFE0400C))
#define GPDMA_INT_ERR_CLR		(*(volatile uint32_t*)(0xFFE04010))
#define GPDMA_RAW_INT_TCSTAT	(*(volatile uint32_t*)(0xFFE04014))
#define GPDMA_RAW_INT_ERR_STAT	(*(volatile uint32_t*)(0xFFE04018))
#define GPDMA_ENABLED_CHNS		(*(volatile uint32_t*)(0xFFE0401C))
#define GPDMA_SOFT_BREQ			(*(volatile uint32_t*)(0xFFE04020))
#define GPDMA_SOFT_SREQ			(*(volatile uint32_t*)(0xFFE04024))
#define GPDMA_SOFT_LBREQ		(*(volatile uint32_t*)(0xFFE04028))
#define GPDMA_SOFT_LSREQ		(*(volatile uint32_t*)(0xFFE0402C))
#define GPDMA_CONFIG			(*(volatile uint32_t*)(0xFFE04030))
#define GPDMA_SYNC				(*(volatile uint32_t*)(0xFFE04034))

