Zarh/ManaGunZ/MGZ/lib/fatfs/ffsample/lpc23xx/LPC2300.h
#define GPDMA_CH0_SRC		(*(volatile uint32_t*)(0xFFE04100))
#define GPDMA_CH0_DEST		(*(volatile uint32_t*)(0xFFE04104))
#define GPDMA_CH0_LLI		(*(volatile uint32_t*)(0xFFE04108))
#define GPDMA_CH0_CTRL		(*(volatile uint32_t*)(0xFFE0410C))
#define GPDMA_CH0_CFG		(*(volatile uint32_t*)(0xFFE04110))

#define GPDMA_CH1_SRC		(*(volatile uint32_t*)(0xFFE04120))
#define GPDMA_CH1_DEST		(*(volatile uint32_t*)(0xFFE04124))
#define GPDMA_CH1_LLI		(*(volatile uint32_t*)(0xFFE04128))
#define GPDMA_CH1_CTRL		(*(volatile uint32_t*)(0xFFE0412C))
#define GPDMA_CH1_CFG		(*(volatile uint32_t*)(0xFFE04130))

#define USB_INT_STAT		(*(volatile uint32_t*)(0xE01FC1C0))

#define DEV_INT_STAT		(*(volatile uint32_t*)(0xFFE0C200))
#define DEV_INT_EN			(*(volatile uint32_t*)(0xFFE0C204))
#define DEV_INT_CLR     	(*(volatile uint32_t*)(0xFFE0C208))
#define DEV_INT_SET     	(*(volatile uint32_t*)(0xFFE0C20C))
#define DEV_INT_PRIO    	(*(volatile uint32_t*)(0xFFE0C22C))

#define EP_INT_STAT			(*(volatile uint32_t*)(0xFFE0C230))
#define EP_INT_EN       	(*(volatile uint32_t*)(0xFFE0C234))
#define EP_INT_CLR      	(*(volatile uint32_t*)(0xFFE0C238))
#define EP_INT_SET      	(*(volatile uint32_t*)(0xFFE0C23C))
#define EP_INT_PRIO     	(*(volatile uint32_t*)(0xFFE0C240))

#define REALIZE_EP      	(*(volatile uint32_t*)(0xFFE0C244))
#define EP_INDEX        	(*(volatile uint32_t*)(0xFFE0C248))
#define MAXPACKET_SIZE  	(*(volatile uint32_t*)(0xFFE0C24C))

#define CMD_CODE        	(*(volatile uint32_t*)(0xFFE0C210))
#define CMD_DATA        	(*(volatile uint32_t*)(0xFFE0C214))

#define RX_DATA				(*(volatile uint32_t*)(0xFFE0C218))
#define TX_DATA				(*(volatile uint32_t*)(0xFFE0C21C))
#define RX_PLENGTH			(*(volatile uint32_t*)(0xFFE0C220))
#define TX_PLENGTH			(*(volatile uint32_t*)(0xFFE0C224))
#define USB_CTRL			(*(volatile uint32_t*)(0xFFE0C228))

#define DMA_REQ_STAT		(*(volatile uint32_t*)(0xFFE0C250))
#define DMA_REQ_CLR			(*(volatile uint32_t*)(0xFFE0C254))
#define DMA_REQ_SET			(*(volatile uint32_t*)(0xFFE0C258))
#define UDCA_HEAD			(*(volatile uint32_t*)(0xFFE0C280))
#define EP_DMA_STAT			(*(volatile uint32_t*)(0xFFE0C284))
#define EP_DMA_EN			(*(volatile uint32_t*)(0xFFE0C288))
#define EP_DMA_DIS			(*(volatile uint32_t*)(0xFFE0C28C))
#define DMA_INT_STAT		(*(volatile uint32_t*)(0xFFE0C290))
#define DMA_INT_EN			(*(volatile uint32_t*)(0xFFE0C294))
#define EOT_INT_STAT		(*(volatile uint32_t*)(0xFFE0C2A0))
#define EOT_INT_CLR			(*(volatile uint32_t*)(0xFFE0C2A4))
#define EOT_INT_SET			(*(volatile uint32_t*)(0xFFE0C2A8))
#define NDD_REQ_INT_STAT	(*(volatile uint32_t*)(0xFFE0C2AC))
#define NDD_REQ_INT_CLR		(*(volatile uint32_t*)(0xFFE0C2B0))
#define NDD_REQ_INT_SET		(*(volatile uint32_t*)(0xFFE0C2B4))
#define SYS_ERR_INT_STAT	(*(volatile uint32_t*)(0xFFE0C2B8))
#define SYS_ERR_INT_CLR		(*(volatile uint32_t*)(0xFFE0C2BC))
#define SYS_ERR_INT_SET		(*(volatile uint32_t*)(0xFFE0C2C0))

#define HC_REVISION			(*(volatile uint32_t*)(0xFFE0C000))
#define HC_CONTROL			(*(volatile uint32_t*)(0xFFE0C004))
#define HC_CMD_STAT			(*(volatile uint32_t*)(0xFFE0C008))
#define HC_INT_STAT			(*(volatile uint32_t*)(0xFFE0C00C))
#define HC_INT_EN			(*(volatile uint32_t*)(0xFFE0C010))
#define HC_INT_DIS			(*(volatile uint32_t*)(0xFFE0C014))
#define HC_HCCA				(*(volatile uint32_t*)(0xFFE0C018))
#define HC_PERIOD_CUR_ED	(*(volatile uint32_t*)(0xFFE0C01C))
#define HC_CTRL_HEAD_ED		(*(volatile uint32_t*)(0xFFE0C020))
#define HC_CTRL_CUR_ED		(*(volatile uint32_t*)(0xFFE0C024))
#define HC_BULK_HEAD_ED		(*(volatile uint32_t*)(0xFFE0C028))
#define HC_BULK_CUR_ED		(*(volatile uint32_t*)(0xFFE0C02C))
#define HC_DONE_HEAD		(*(volatile uint32_t*)(0xFFE0C030))
#define HC_FM_INTERVAL		(*(volatile uint32_t*)(0xFFE0C034))
#define HC_FM_REMAINING		(*(volatile uint32_t*)(0xFFE0C038))
#define HC_FM_NUMBER		(*(volatile uint32_t*)(0xFFE0C03C))
#define HC_PERIOD_START		(*(volatile uint32_t*)(0xFFE0C040))
#define HC_LS_THRHLD		(*(volatile uint32_t*)(0xFFE0C044))
#define HC_RH_DESCA			(*(volatile uint32_t*)(0xFFE0C048))
#define HC_RH_DESCB			(*(volatile uint32_t*)(0xFFE0C04C))
#define HC_RH_STAT			(*(volatile uint32_t*)(0xFFE0C050))
#define HC_RH_PORT_STAT1	(*(volatile uint32_t*)(0xFFE0C054))
#define HC_RH_PORT_STAT2	(*(volatile uint32_t*)(0xFFE0C058))

#define OTG_INT_STAT		(*(volatile uint32_t*)(0xFFE0C100))
#define OTG_INT_EN			(*(volatile uint32_t*)(0xFFE0C104))
#define OTG_INT_SET			(*(volatile uint32_t*)(0xFFE0C108))
#define OTG_INT_CLR			(*(volatile uint32_t*)(0xFFE0C10C))
#define OTG_STAT_CTRL       (*(volatile uint32_t*)(0xFFE0C110))
#define OTG_TIMER           (*(volatile uint32_t*)(0xFFE0C114))

#define OTG_I2C_RX			(*(volatile uint32_t*)(0xFFE0C300))
#define OTG_I2C_TX			(*(volatile uint32_t*)(0xFFE0C300))
#define OTG_I2C_STS			(*(volatile uint32_t*)(0xFFE0C304))
#define OTG_I2C_CTL			(*(volatile uint32_t*)(0xFFE0C308))
#define OTG_I2C_CLKHI		(*(volatile uint32_t*)(0xFFE0C30C))
#define OTG_I2C_CLKLO		(*(volatile uint32_t*)(0xFFE0C310))

#define OTG_CLK_CTRL		(*(volatile uint32_t*)(0xFFE0CFF4))
#define OTG_CLK_STAT		(*(volatile uint32_t*)(0xFFE0CFF8))

#define USBPortSel			(*(volatile uint32_t*)(0xFFE0C110))
#define USBClkCtrl			(*(volatile uint32_t*)(0xFFE0CFF4))
#define USBClkSt			(*(volatile uint32_t*)(0xFFE0CFF8))

#define MAC_MAC1			(*(volatile uint32_t*)(0xFFE00000))
#define MAC_MAC2			(*(volatile uint32_t*)(0xFFE00004))
#define MAC_IPGT			(*(volatile uint32_t*)(0xFFE00008))
#define MAC_IPGR			(*(volatile uint32_t*)(0xFFE0000C))
#define MAC_CLRT			(*(volatile uint32_t*)(0xFFE00010))
#define MAC_MAXF			(*(volatile uint32_t*)(0xFFE00014))
#define MAC_SUPP			(*(volatile uint32_t*)(0xFFE00018))
#define MAC_TEST			(*(volatile uint32_t*)(0xFFE0001C))
#define MAC_MCFG			(*(volatile uint32_t*)(0xFFE00020))
#define MAC_MCMD			(*(volatile uint32_t*)(0xFFE00024))
#define MAC_MADR			(*(volatile uint32_t*)(0xFFE00028))
#define MAC_MWTD			(*(volatile uint32_t*)(0xFFE0002C))
#define MAC_MRDD			(*(volatile uint32_t*)(0xFFE00030))
#define MAC_MIND			(*(volatile uint32_t*)(0xFFE00034))

