Zarh/ManaGunZ/MGZ/lib/fatfs/ffsample/lpc23xx/LPC2300.h
#define MAC_SA0				(*(volatile uint32_t*)(0xFFE00040))
#define MAC_SA1				(*(volatile uint32_t*)(0xFFE00044))
#define MAC_SA2				(*(volatile uint32_t*)(0xFFE00048))

#define MAC_COMMAND			(*(volatile uint32_t*)(0xFFE00100))
#define MAC_STATUS			(*(volatile uint32_t*)(0xFFE00104))
#define MAC_RXDESCRIPTOR	(*(volatile uint32_t*)(0xFFE00108))
#define MAC_RXSTATUS		(*(volatile uint32_t*)(0xFFE0010C))
#define MAC_RXDESCRIPTORNUM	(*(volatile uint32_t*)(0xFFE00110))
#define MAC_RXPRODUCEINDEX	(*(volatile uint32_t*)(0xFFE00114))
#define MAC_RXCONSUMEINDEX	(*(volatile uint32_t*)(0xFFE00118))
#define MAC_TXDESCRIPTOR	(*(volatile uint32_t*)(0xFFE0011C))
#define MAC_TXSTATUS		(*(volatile uint32_t*)(0xFFE00120))
#define MAC_TXDESCRIPTORNUM	(*(volatile uint32_t*)(0xFFE00124))
#define MAC_TXPRODUCEINDEX	(*(volatile uint32_t*)(0xFFE00128))
#define MAC_TXCONSUMEINDEX	(*(volatile uint32_t*)(0xFFE0012C))

#define MAC_TSV0			(*(volatile uint32_t*)(0xFFE00158))
#define MAC_TSV1			(*(volatile uint32_t*)(0xFFE0015C))
#define MAC_RSV				(*(volatile uint32_t*)(0xFFE00160))

#define MAC_FLOWCONTROLCNT	(*(volatile uint32_t*)(0xFFE00170))
#define MAC_FLOWCONTROLSTS	(*(volatile uint32_t*)(0xFFE00174))

#define MAC_RXFILTERCTRL	(*(volatile uint32_t*)(0xFFE00200))
#define MAC_RXFILTERWOLSTS	(*(volatile uint32_t*)(0xFFE00204))
#define MAC_RXFILTERWOLCLR	(*(volatile uint32_t*)(0xFFE00208))

#define MAC_HASHFILTERL		(*(volatile uint32_t*)(0xFFE00210))
#define MAC_HASHFILTERH		(*(volatile uint32_t*)(0xFFE00214))

#define MAC_INTSTATUS		(*(volatile uint32_t*)(0xFFE00FE0))
#define MAC_INTENABLE		(*(volatile uint32_t*)(0xFFE00FE4))
#define MAC_INTCLEAR		(*(volatile uint32_t*)(0xFFE00FE8))
#define MAC_INTSET			(*(volatile uint32_t*)(0xFFE00FEC))

#define MAC_POWERDOWN		(*(volatile uint32_t*)(0xFFE00FF4))
#define MAC_MODULEID		(*(volatile uint32_t*)(0xFFE00FFC))



/*--------------------------------------------------------------*/
/* Power/PCLK controls                                          */
/*--------------------------------------------------------------*/

/* LPC2300 Peripheral Divider */
#define	__set_PCLKSEL(p,v)	PCLKSEL[(p) / 16] = (PCLKSEL[(p) / 16] & ~(3 << ((p) * 2 % 32))) | (v << ((p) * 2 % 32))
#define PCLKDIV_4	0
#define PCLKDIV_1	1
#define PCLKDIV_2	2
#define PCLKDIV_8	3
#define PCLK_WDT	0
#define PCLK_TIMER0	1
#define PCLK_TIMER1	2
#define PCLK_UART0	3
#define PCLK_UART1	4
#define PCLK_PWM1	6
#define PCLK_I2C0	7
#define PCLK_SPI	8
#define PCLK_RTC	9
#define PCLK_SSP1	10
#define PCLK_DAC	11
#define PCLK_ADC	12
#define PCLK_CAN1	13
#define PCLK_CAN2	14
#define PCLK_ACF	15
#define PCLK_BAT_RAM 16
#define PCLK_GPIO	17
#define PCLK_PCB	18
#define PCLK_I2C1	19
#define PCLK_SSP0	21
#define PCLK_TIMER2	22
#define PCLK_TIMER3	23
#define PCLK_UART2	24
#define PCLK_UART3	25
#define PCLK_I2C2	26
#define PCLK_I2S	27
#define PCLK_MCI	28
#define PCLK_SYSCON	 30


/* LPC2300 Pin Configuration */
#define __set_PINSEL(p,b,v)  PINSEL[(p) * 2 + (b) / 16] = (PINSEL[(p) * 2 + (b) / 16] & ~(3 << ((b) * 2 % 32))) | (v << ((b) * 2 % 32))
#define __set_PINMODE(p,b,v) PINMODE[(p) * 2 + (b) / 16] = (PINMODE[(p) * 2 + (b) / 16] & ~(3 << ((b) * 2 % 32))) | (v << ((b) * 2 % 32))
#define PINMODE_PU	0
#define PINMODE_HIZ	2
#define PINMODE_PD	3


/* LPC2300 Power Control */
#define	__set_PCONP(b)	PCONP |= (b)
#define	__clr_PCONP(b)	PCONP &= ~(b)
#define PCTIM0	0x00000002
#define PCTIM1	0x00000004
#define PCUART0	0x00000008
#define PCUART1	0x00000010
#define PCPWM1	0x00000040
#define PCI2C0	0x00000080
#define PCSPI	0x00000100
#define PCRTC	0x00000200
#define PCSSP1	0x00000400
#define PCEMC	0x00000800
#define PCAD	0x00001000
#define PCAN1	0x00002000
#define PCAN2	0x00004000
#define PCI2C1	0x00080000
#define PCSSP0	0x00200000
#define PCTIM2	0x00400000
#define PCTIM3	0x00800000
#define PCUART2	0x01000000
#define PCUART3	0x02000000
#define PCI2C2	0x04000000
#define PCI2S	0x08000000
#define PCSDC	0x10000000
#define PCGPDMA	0x20000000
#define PCENET	0x40000000
#define PCUSB	0x80000000



/*--------------------------------------------------------------*/
/* Misc Macros                                                  */
/*--------------------------------------------------------------*/

/* Bit definitions */
#define	_BV(bit) (1<<(bit))

/* Import a binary file */
#define	IMPORT_BIN(sect, file, sym) asm (\
		".section " #sect "\n"                  /* Change section */\
		".balign 4\n"                           /* Word alignment */\
		".global " #sym "\n"                    /* Export the object address to other modules */\
		#sym ":\n"                              /* Define the object label */\
		".incbin \"" file "\"\n"                /* Import the file */\
		".global _sizeof_" #sym "\n"            /* Export the object size to oher modules */\
		".set _sizeof_" #sym ", . - " #sym "\n" /* Define the object size */\
		".balign 4\n"                           /* Word alignment */\
		".section \".text\"\n")                 /* Restore section */

/* Import a part of binary file */
#define	IMPORT_BIN_PART(sect, file, ofs, siz, sym) asm (\
		".section " #sect "\n"\
		".balign 4\n"\
		".global " #sym "\n"\
		#sym ":\n"\
		".incbin \"" file "\"," #ofs "," #siz "\n"\
		".global _sizeof_" #sym "\n"\
		".set _sizeof_" #sym ", . - " #sym "\n"\
		".balign 4\n"\
		".section \".text\"\n")



#endif	/* #ifdef __LPC2300 */

